#include <stdio.h>

int main(void){
    unsigned short s = +0b10; 
    unsigned i = -077; 
    unsigned long l = +0x10;

    signed short s2 = +0b10;
    signed i2 = -077;
    signed long l2 = +0x10;

    // 八进制：-077
    // 二进制：1000 0000 0000 0000 0000 0000  0011 1111
    // 按有符号算：-（1+2+4+8+16+32）= -63
    // 按无符号算：2^31 + 1 + 2 + 4 + 8 + 16 + 32 = 2147483711 
    
    // 补码：  1111 1111 1111 1111 1111 1111 1100 0001
    // 按有符号算：减1取反，得原码，值为-63
    //         1000 0000 0000 0000 0000 0000 0011 1111
    // 按无符号算：补码就是原码
    //         1111 1111 1111 1111 1111 1111 1100 0001
    //         值为：2^31 + 2^30 + ... + 2^6 + 1 = 4294967233

    // 无符号数两种输出    
    printf("s = %hd, i = %d, l = %ld; \n",s,i,l);
    printf("s = %hu, i = %u, l = %lu; \n",s,i,l);
    // 有符号数两种输出
    printf("s2 = %hd, i2 = %d, l2 = %ld; \n",s2,i2,l2);
    printf("s2 = %hu, i2 = %u, l2 = %lu; \n",s2,i2,l2);
    
    return 0;
}
