#include <stdio.h>

int main(void){
    //unsigned short s = 0xffff; 
    // 二进制：1111 1111 1111 1111
    /* 错误算法：
       按有符号算：-(1+2+.....2^14))
       按无符号算：2^16 - 1 = 65535
    */
    unsigned short s = 65535; 
    /* 正确算法：
       按有符号算：补码减1取反，得原码
              1000 0000 0000 0001
              值为-1 
       按无符号算：补码即为原码
              1111 1111 1111 1111
              值为2^16 - 1 = 65535
     */
    

    //unsigned i = 0x80000001; 
    // 二进制1000 0000 0000 0000 0000 0000 0000 0001
    /* 错误算法：
       按有符号算：-1
       按无符号算：2^31 + 1 = 2147483649
    */  

    /* 正确算法：
       按有符号算：补码减1，按位取反，得原码
            1111 1111 1111 1111 1111 1111 1111 1111
            值为：-(2^0+2^1+...+2^30) = -(2^31-1) = -2147483647    
       按无符号算：补码即原码，值为2^31 + 1 = 2147483649
    */
     unsigned i = 0x8000001; 
    // 二进制0000 1000 0000 0000 0000 0000 0000 0001
    // 错误算法：
    // 按有符号算：2^27 + 1 = 134217729
    // 按无符号算：2^27 + 1 = 134217729
    
    // 正确算法：
    // 按有符号算：补码即原码，值为：134217729
    // 按无符号算：补码即原码，值为：134217729
    unsigned long l = 100;

    short s2 = 32767;;
    int i2 = -1;
    // 二进制1000 0000 0000 0000 0000 0000 0000 0001
    /* 错误算法：
       按有符号算：-1
       按无符号算：2^31 + 1 = 2147483649
    */

    /* 正确算法：
       内存中为补码：1111 1111 1111 1111 1111 1111 1111 1111
           按有符号算：补码减1，取反，得原码
                     1000 0000 0000 0000 0000 0000 0000 0001
                     值为-1
           按无符号算：补码即原码
                     值为2^32 - 1  = 4294967295
    */
    long l2 = -1;

    printf("s = %hd, i = %d, l = %ld\n",s,i,l);//无符号数按有符号输出
    printf("s = %hu, i = %u, l = %lu\n",s,i,l);// 无符号数按无符号输出
    printf("s2 = %hd, i2 = %d, l2 = %ld\n",s2,i2,l2);//有符号数按有符号输出
    printf("s2 = %hu, i2 = %u, l2 = %lu\n",s2,i2,l2);//有符号数按无符号输出

    return 0;
}
